app/controllers/admin/users_controller.rb

  def index
    @users = User.all.page(params[:page]).per(10)
---
SELECT "users".* FROM "users"