app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    if params[:title] || params[:director] || params[:runtime_in_minutes]
        case params[:runtime_in_minutes]
        when '1'
          min = 0
          max = 89
        when '2'
          min = 90
          max = 119
        when '3'
          min = 120
          max = 1000
        else
          min = 0
          max = 1000
        end
      @movies = Movie.title_or_director_search(params[:query]).runtime_search(min, max)

      # @movies = Movie.title_search(params[:title]).director_search(params[:director]).runtime_search(min, max)
    else
      @movies = Movie.all

INSERT INTO "movies" ("created_at", "description", "director", "poster_image_url", "poster_img", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    if @movie.save